stress-test/proxy-stress-post.yml
config:
  target: "http://localhost:6002/api/nearbyworkspaces"
  phases:
    - duration: 60
      arrivalRate: 100
      name: Initial
    - pause: 10
      name: Break
    - duration: 60
      arrivalRate: 100
      rampTo: 150
      name: Ramp Up
  payload:
    path: "newRecordIds.csv"
    fields:
      - "workspaceId"
scenarios:
  - flow:
    - post:
        url: "/buildings/{{ workspaceId }}"
        json:
          longitude: "-92.701"
          latitude: "35.5889"