stress-test/proxy-stresstest.yml
config:
  target: "http://localhost:6002/api/nearbyworkspaces"
  phases:
    - duration: 60
      arrivalRate: 100
      name: Initial
    - pause: 10
      name: Break
    - duration: 60
      arrivalRate: 100
      rampTo: 150
      name: Ramp Up
  payload:
    path: "workspaceIds.csv"
    fields:
      - "workspaceId"
scenarios:
  - flow:
    - get:
        url: "/buildings/{{ workspaceId }}"